[{"review":"This movie was so weak that it couldn't even come up with good cliches to rip off. I love horror movies and will see practically anything, but if I had it to do over again I would have skipped this one entirely. You may think that I'm exaggerating, but I challenge anyone to find anything even remotely satisfying or interesting about this piece of garbage. Not scary, not funny, not curious, not worth it.","sentiment":"negative"},{"review":"A BUSTER KEATON Silent Short.<br \/><br \/>Poor Buster becomes THE GOAT (\"scapegoat\") for a dangerous escaped murderer.<br \/><br \/>This is a wonderful, hilarious little film with Keaton at his absolute best. In what is essentially a series of chases, Buster gets to exercise his endlessly inventive imagination. Big Joe Roberts appears as the highly suspicious police chief.<br \/><br \/>Born into a family of Vaudevillian acrobats, Buster Keaton (1895-1966) mastered physical comedy at a very early age. An association with Fatty Arbuckle led to a series of highly imaginative short subjects and classic, silent feature-length films - all from 1920 to 1928. Writer, director, star & stuntman - Buster could do it all and his intuitive genius gave him almost miraculous knowledge as to the intricacies of film making and of what it took to please an audience. More akin to Fairbanks than Chaplin, Buster's films were full of splendid adventure, exciting derring-do and the most dangerous physical stunts imaginable. His theme of a little man against the world, who triumphs through bravery & ingenuity, dominates his films. Through every calamity & disaster, Buster remained the Great Stone Face, a stoic survivor in a universe gone mad.<br \/><br \/>In the late 1920's Buster was betrayed by his manager\/brother-in-law and his contract was sold to MGM, which proceeded to nearly destroy his career. Teamed initially with Jimmy Durante and eventually allowed small roles in mediocre comedies, Buster was for 35 years consistently given work far beneath his talent. Finally, before lung cancer took him at age 70, he had the satisfaction of knowing that his classic films were being rediscovered. Now, well past his centenary, Buster Keaton is routinely recognized & appreciated as one of cinema's true authentic geniuses. And he knew how to make people laugh...","sentiment":"positive"},
{"review":"Harrison Ford plays Sergeant Dutch Van Den Broeck of the District of Columbia Police Department. He tries to get the bad guys, but doesn't do a very good job. When we meet up with him he's trying to catch a corrupt undercover officer. Kristin Scott Thomas plays a New Hampshire Senator, Kay Chandler, trying to get reelected. She's running against a candidate who has plenty of money. The last thing she needs is the death of her husband. She's a politician- she can't be bogged down by feelings.<br \/><br \/>This story moves slowly and painfully. I was looking at my watch every five minutes wondering when it would be over! The story gets lost in details the director, Sydney Pollack, didn't need to put in. We don't want to know about Dutch's police investigations. They throw in some insight to politicians and the \u0091spin control' they do for campaigns. After seeing the movie I'm still wondering why they got involved romantically. Doesn't anybody mourn anymore? Don't you need more than two weeks to even consider going \u0091horizontal' with someone else?<br \/><br \/>It was good to see actress, comedian, Chicago native and Second City Alumni Bonnie Hunt. Her role isn't necessarily comic relief, but she was the only one I wanted to see more of. Do yourself a favor, wait for it on video if you want to see it at all.","sentiment":"negative"},{"review":"Forget everything that you have ever read about the Mallachi Brothers' straight-to-video release \"Snakes on a Train,\" especially if it was a negative review. This movie is way more fun than the movie that it obviously rips off: \"Snakes on a Plane.\" Frankly, I am surprised that more people aren't rhapsodizing about this low-budget Asylum Release. Instead, most reviews that I've read have nothing kind or critically worthwhile to say except the usual stupid herd mentality idiocy, such as the acting was amateurish, the action didn't numerically live up to the advertising, and the entire thing amounted to a hideous waste of time. Of course, it doesn't help that the title is a tip-off to the obvious rip-off nature of this film. Actually, I felt that \"Snakes on a Train\" surpassed \"Snakes on a Plane\" for a number of reasons.<br \/><br \/>First, the producers used real, genuine snakes until the last fifteen minutes when they substituted either giant fake snake heads or computer generated a super-giant snake that consumed an entire Amtrak like train. How many movies have a snake gobble a train? As a result, \"Snakes on a Train\" ranks as the first movie to scale that height.<br \/><br \/>Second, this low-budget movie employs some grisly gross-out effects. The woman who coughs up baby snakes--real ones--was fantastic! The special effects of her forearms getting tore up later in the movie were visually enticing! Also, you get to see a little white girl get eaten alive by a snake. She was as cute as she could be, no more than 10 years old or thereabouts, and she died screaming all the way as nasty olé giant mister snake head swallows her. Not only kids in jeopardy but kid eaten! This is exactly the kind of graphic material that you won't find in 99 % of all theatrical Hollywood releases. Of course, she wasn't eaten by a real snake, but it's the subversive thought that counts.<br \/><br \/>Third, it is one of those cursed upon movies where Alma (Julia Ruiz of \"That Guy\"), the chief female character--no heroine--has a curse placed on her by her parents because she didn't marry the man that they recommended. As a result, she is filled with snakes, coughs up quantities of green radiator fluid slop then chucks up a baby snake. Imagine Medusa, the mythical characters that had snakes for hair, only with the snakes in her belly. Her psycho-shaman type boyfriend collects all the snakes that come out of her because they are heading to L.A. on a train to see a relative of his who can put all the snakes back inside of her and return her to normal. Talk about a whacked out character performing stomach churning routines. Prepare yourself for lots of slime, blood, and gore. <br \/><br \/>Fourth, the train had only about twenty or so passengers, not hundreds. Nevertheless, it looked like the Mallachi Brothers filmed this above-average horror flick on-board a real train with real snakes and they played up the swaying motion of the train on the tracks.<br \/><br \/>Fifth, the snakes slither around for the first hour, quietly infiltrating the train before they turn weird and attack everybody. In other words, it's suspense, suspense, suspense, before people start dying from snake bites.<br \/><br \/>Up until the last five minutes when the snake grows bigger than the runaway train and swallows it, \"Snakes on a Train\" is warped, wonderful, and way-out. It doesn't have the Attention Deficit editing of a big league Hollywood movie. It's a fantasy about an unfortunate Hispanic women victimized because of her feminist, at-odds-with-society attitude. <br \/><br \/>Altogether, you've got gory fantasy type stuff; suspenseful snakes slithering around the train, and am over-the-top gigantic snake at the end. Incidentally, they get on board the train because a bunch of other Mexicans have bribed a train employee and the Mexicans on board think that the girl is so cute that they let her and her boyfriend on free.<br \/><br \/>I think it's better than \"Snakes on a Plane\" if you want a tough, little, independently produced horror movie.","sentiment":"positive"},{"review":"...had I watched it in my teenage years. This movie was mildly entertaining. What I liked about Soul Survivors were the gothic atmosphere during the party scenes, and the constant flips between 'dream' and 'reality.<br \/><br \/>Had there not been movies like 'The 6th Sense' and 'Don't Look Now' I would have been surprised by the ending.","sentiment":"negative"},{"review":"\"French Cancan\" is one of my favorite all time movies. It's an excellent film. There's color, there's humor, there's music. It's a very good portrait of the so called Belle Époque, though Jean Renoir's priorities were always to show a creation, a fantasie. So the film isn't a historical movie. The final sequences in which the girls dance cancan are unforgettable images. It's a film you shouldn't miss.","sentiment":"positive"},{"review":"My kids picked this out at the video store...it's great to hear Liza as Dorothy cause she sounds just like her mom. But there are too many bad songs, and the animation is pretty crude compared to other cartoons of that time.","sentiment":"negative"},{"review":"Rea, Sutherland, DeMunn, and von Sydow (in a small role) are all brilliant in their performances. Sutherland is particularly adept at this sort of role, where he must portray a character whose morality is, at first, uncertain to the audience. As is so often the case with Sutherland's characters, we must ask \"is he a villian [in this case, a minor one], or a hero?\"<br \/><br \/>This is a disturbing story, intelligently told, about the incompetence and fearful bureaucracy in the old Soviet Union that impeded the efforts of extremely competent people. As Sutherland's character wryly notes, \"The measure of a bureaucracy is its ability not to make special exceptions\". The \"committee meeting\" (between Rea and Sutherland's characters) after perestroika is enforced, with its revelations, has enormous emotional impact. You can feel the suffering of the dedicated people who labored in that system.<br \/><br \/>The handful of dramatic scenes portraying victims' family members adds emotional resonance to the impact of the story. This is seldom a feature of a film with this sickening subject matter, but effectively reminds us that the victims had lives, and were loved.<br \/><br \/>This is a sad, but very important film, which deserved its showcase on Canada's History Television.","sentiment":"positive"},{"review":"An updated version of a theme which has been done before. While that in and of itself is not bad, this movie doesn't reach the ring like the other \"inherent and pure\" evil ones do. <br \/><br \/>Predictable, ambitious attempt that falls short of the mark. Not worth sitting through for the tired contrived ending.","sentiment":"negative"},{"review":"The comparison is perhaps unfair, but inevitable. Those attracted to the intimacy and depth of Umbrellas will be slightly horrified to discover a cut-and-paste musical in the American style - awkward, stilted dialogue with inexplicable song-and-dance numbers. Gene Kelly's French accent was apparently so poor, that a dreadful job of dubbing was substituted (as you'll remember, the dubbing was almost perfectly pulled off in Umbrellas). The translation of the French (for subtitled versions), as well, leaves something to be desired, although this can't be attributed to Demy. The film also has several self-aware moments that come off a wee disconcerting, such as references in songs to LeGrand himself. And the costumes - well, the tight pants\/white boots combination, and the freakishly unnatural colors, reminds one of an Austin Powers film . . .<br \/><br \/>But Demy does reward the viewer with allusions to Umbrellas; note, for instance, the suitcase carried by Maxence in his departure from Rochefort - this is the same suitcase carried by Guy in his departure from Cherbourg. Also, note the \"Convenient Brunette of Resolution\" - Madeleine in Umbrellas, and Josette in Young Girls.<br \/><br \/>Generally speaking, those expecting the natural feel of Umbrellas (save the floating bicycle scene), or looking for similar deeper questions and ambiguous endings as in Umbrella's script, should probably pass this one b y. Those looking for a French version of a thin '60s American musical will be quite happy.","sentiment":"negative"},{"review":"This must have been one of the worst movies I have ever seen.<br \/><br \/>I have to disagree with another commenter, who said the special effects were okay. I found them pretty bad: it just wasn't realistic and they were so fake that it just distracted from the actual story.<br \/><br \/>Maybe that distraction is the reason that I did not fully understand the story. The archaeologists are looking for \"the set\". They do not bother to tell what set, or what is so special about it. That also makes it unclear why they search for it in California, while the intro of the movie takes place in ancient Egypt.<br \/><br \/>If you're shooting a movie that takes place in the desert, take the effort to actually go to the desert. The beginning - the ancient ceremony - looks like it was shot inside a studio instead of a desert.<br \/><br \/>The action-level was constant throughout the movie, no ups and downs, no climax. It made the movie look short, and that's certainly a pro for this particular movie.","sentiment":"negative"},{"review":"This is only the fourth effort I’ve watched from this director (whom I met and found quite genial at the 2004 Venice Film Festival Italian B-movie retrospective) and also, possibly, the worst. As was the case with THE BRONX EXECUTIONER (1989), which preceded it, this is a prime example from the tail end of the Euro-Cult era – prime because it shows the depths to which the previously invigorating style had fallen by this time! <br \/><br \/>Here, in fact, we get a plot revolving around – I’m not kidding, folks – a killer phone! Pretty but bland Charlotte Lewis – in her third film after PIRATES (1986) and THE GOLDEN CHILD (1986) – is a model who, apparently, has just ended an affair; she keeps expecting her architect lover to call her back but, every time the phone rings, all she gets is static accompanied by voices from the beyond (or some such crap). She befriends a new tenant at her apartment block who, conveniently, knows of an authority on paranormal activity (William Berger) – who, hilariously, explains that the negative energy which is unleashed, say, during family arguments can manifest itself via home appliances into a deadly force (I swear I ain’t making this up)! <br \/><br \/>Among the highlights...er...lowpoints of the film are: the grumpy bartender from whose dingy place the heroine calls a couple of times (it seems that the chain-of-events can only be broken by having Lewis go through her paces again, EXTERMINATING ANGEL (1962)-style!), the sheer variety of preposterous-looking phones on display, the apparatus of the heroine’s photographer friend sneaking up on her before the kill, the sarcastic cop who greets Lewis on reporting the strange occurrences (“And what’s the toaster up to, I wonder?”), the would-be rapist killed by a barrage of coins shooting out from a telephone booth, and Berger’s own bloody demise (with the phone affecting the pacemaker he’s fitted with and causing the doctor’s heart to explode)! <br \/><br \/>The film’s climax is rather confusing and, apparently, finally sees all the ‘lost souls’ inhabiting a flock of doves and flying out the window of the ‘possessed’ office (a lonelyhearts service!). For what it’s worth, the score – by ex-Goblin Claudio Simonetti no less – is effective enough, despite the inclusion of dated heavy-metal numbers on the soundtrack.","sentiment":"negative"}]